sh-lyf/XenD101_HPS/Driver/py32f003/PY32F003_HAL_Driver/Src/py32f003_hal_tim.c
            TIM_OC2_SetConfig(htim->Instance, &temp1);
            break;
        }
        default:
            break;
        }

        switch (InputChannel)
        {
        case TIM_CHANNEL_1:
        {
            assert_param(IS_TIM_CC1_INSTANCE(htim->Instance));

            TIM_TI1_SetConfig(htim->Instance, sConfig->ICPolarity,
                              sConfig->ICSelection, sConfig->ICFilter);

            /* Reset the IC1PSC Bits */
            htim->Instance->CCMR1 &= ~TIM_CCMR1_IC1PSC;

            /* Select the Trigger source */
            htim->Instance->SMCR &= ~TIM_SMCR_TS;
            htim->Instance->SMCR |= TIM_TS_TI1FP1;

            /* Select the Slave Mode */
            htim->Instance->SMCR &= ~TIM_SMCR_SMS;
            htim->Instance->SMCR |= TIM_SLAVEMODE_TRIGGER;
            break;
        }
        case TIM_CHANNEL_2:
        {
            assert_param(IS_TIM_CC2_INSTANCE(htim->Instance));

            TIM_TI2_SetConfig(htim->Instance, sConfig->ICPolarity,
                              sConfig->ICSelection, sConfig->ICFilter);

            /* Reset the IC2PSC Bits */
            htim->Instance->CCMR1 &= ~TIM_CCMR1_IC2PSC;

            /* Select the Trigger source */
            htim->Instance->SMCR &= ~TIM_SMCR_TS;
            htim->Instance->SMCR |= TIM_TS_TI2FP2;

            /* Select the Slave Mode */
            htim->Instance->SMCR &= ~TIM_SMCR_SMS;
            htim->Instance->SMCR |= TIM_SLAVEMODE_TRIGGER;
            break;
        }

        default:
            break;
        }

        htim->State = HAL_TIM_STATE_READY;

        __HAL_UNLOCK(htim);

        return HAL_OK;
    }
    else
    {
        return HAL_ERROR;
    }
}

/**
  * @brief  Configure the DMA Burst to transfer Data from the memory to the TIM peripheral
  * @param  htim TIM handle
  * @param  BurstBaseAddress TIM Base address from where the DMA  will start the Data write
  *         This parameter can be one of the following values:
  *            @arg TIM_DMABASE_CR1
  *            @arg TIM_DMABASE_CR2
  *            @arg TIM_DMABASE_SMCR
  *            @arg TIM_DMABASE_DIER
  *            @arg TIM_DMABASE_SR
  *            @arg TIM_DMABASE_EGR
  *            @arg TIM_DMABASE_CCMR1
  *            @arg TIM_DMABASE_CCMR2
  *            @arg TIM_DMABASE_CCER
  *            @arg TIM_DMABASE_CNT
  *            @arg TIM_DMABASE_PSC
  *            @arg TIM_DMABASE_ARR
  *            @arg TIM_DMABASE_RCR
  *            @arg TIM_DMABASE_CCR1
  *            @arg TIM_DMABASE_CCR2
  *            @arg TIM_DMABASE_CCR3
  *            @arg TIM_DMABASE_CCR4
  *            @arg TIM_DMABASE_BDTR
  * @param  BurstRequestSrc TIM DMA Request sources
  *         This parameter can be one of the following values:
  *            @arg TIM_DMA_UPDATE: TIM update Interrupt source
  *            @arg TIM_DMA_CC1: TIM Capture Compare 1 DMA source
  *            @arg TIM_DMA_CC2: TIM Capture Compare 2 DMA source
  *            @arg TIM_DMA_CC3: TIM Capture Compare 3 DMA source
  *            @arg TIM_DMA_CC4: TIM Capture Compare 4 DMA source
  *            @arg TIM_DMA_COM: TIM Commutation DMA source
  *            @arg TIM_DMA_TRIGGER: TIM Trigger DMA source
  * @param  BurstBuffer The Buffer address.
  * @param  BurstLength DMA Burst length. This parameter can be one value
  *         between: TIM_DMABURSTLENGTH_1TRANSFER and TIM_DMABURSTLENGTH_18TRANSFERS.
  * @note   This function should be used only when BurstLength is equal to DMA data transfer length.
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_TIM_DMABurst_WriteStart(TIM_HandleTypeDef *htim, uint32_t BurstBaseAddress,
        uint32_t BurstRequestSrc, uint32_t *BurstBuffer, uint32_t  BurstLength)
{
    return HAL_TIM_DMABurst_MultiWriteStart(htim, BurstBaseAddress, BurstRequestSrc, BurstBuffer, BurstLength,
                                            ((BurstLength) >> 8U) + 1U);
}

/**
  * @brief  Configure the DMA Burst to transfer multiple Data from the memory to the TIM peripheral
  * @param  htim TIM handle
  * @param  BurstBaseAddress TIM Base address from where the DMA will start the Data write
  *         This parameter can be one of the following values:
  *            @arg TIM_DMABASE_CR1
  *            @arg TIM_DMABASE_CR2
  *            @arg TIM_DMABASE_SMCR
  *            @arg TIM_DMABASE_DIER
  *            @arg TIM_DMABASE_SR
  *            @arg TIM_DMABASE_EGR
  *            @arg TIM_DMABASE_CCMR1
  *            @arg TIM_DMABASE_CCMR2
  *            @arg TIM_DMABASE_CCER
  *            @arg TIM_DMABASE_CNT
  *            @arg TIM_DMABASE_PSC
  *            @arg TIM_DMABASE_ARR
  *            @arg TIM_DMABASE_RCR
  *            @arg TIM_DMABASE_CCR1
  *            @arg TIM_DMABASE_CCR2
  *            @arg TIM_DMABASE_CCR3
  *            @arg TIM_DMABASE_CCR4
  *            @arg TIM_DMABASE_BDTR
  * @param  BurstRequestSrc TIM DMA Request sources
  *         This parameter can be one of the following values:
  *            @arg TIM_DMA_UPDATE: TIM update Interrupt source
  *            @arg TIM_DMA_CC1: TIM Capture Compare 1 DMA source
  *            @arg TIM_DMA_CC2: TIM Capture Compare 2 DMA source
  *            @arg TIM_DMA_CC3: TIM Capture Compare 3 DMA source
  *            @arg TIM_DMA_CC4: TIM Capture Compare 4 DMA source
  *            @arg TIM_DMA_COM: TIM Commutation DMA source
  *            @arg TIM_DMA_TRIGGER: TIM Trigger DMA source
  * @param  BurstBuffer The Buffer address.
  * @param  BurstLength DMA Burst length. This parameter can be one value
  *         between: TIM_DMABURSTLENGTH_1TRANSFER and TIM_DMABURSTLENGTH_18TRANSFERS.
  * @param  DataLength Data length. This parameter can be one value
  *         between 1 and 0xFFFF.
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_TIM_DMABurst_MultiWriteStart(TIM_HandleTypeDef *htim, uint32_t BurstBaseAddress,
        uint32_t BurstRequestSrc, uint32_t *BurstBuffer,
        uint32_t  BurstLength,  uint32_t  DataLength)
{
    /* Check the parameters */
    assert_param(IS_TIM_DMABURST_INSTANCE(htim->Instance));
    assert_param(IS_TIM_DMA_BASE(BurstBaseAddress));
    assert_param(IS_TIM_DMA_SOURCE(BurstRequestSrc));
    assert_param(IS_TIM_DMA_LENGTH(BurstLength));
    assert_param(IS_TIM_DMA_DATA_LENGTH(DataLength));

    if (htim->State == HAL_TIM_STATE_BUSY)
    {
        return HAL_BUSY;
    }
    else if (htim->State == HAL_TIM_STATE_READY)
    {
        if ((BurstBuffer == NULL) && (BurstLength > 0U))
        {
            return HAL_ERROR;
        }
        else
        {
            htim->State = HAL_TIM_STATE_BUSY;
        }
    }
    else
    {
        /* nothing to do */
    }
    switch (BurstRequestSrc)
    {
    case TIM_DMA_UPDATE:
    {
        /* Set the DMA Period elapsed callbacks */
        htim->hdma[TIM_DMA_ID_UPDATE]->XferCpltCallback = TIM_DMAPeriodElapsedCplt;
        htim->hdma[TIM_DMA_ID_UPDATE]->XferHalfCpltCallback = TIM_DMAPeriodElapsedHalfCplt;

        /* Set the DMA error callback */
        htim->hdma[TIM_DMA_ID_UPDATE]->XferErrorCallback = TIM_DMAError ;

        /* Enable the DMA channel */
        if (HAL_DMA_Start_IT(htim->hdma[TIM_DMA_ID_UPDATE], (uint32_t)BurstBuffer,
                             (uint32_t)&htim->Instance->DMAR, DataLength) != HAL_OK)
        {
            return HAL_ERROR;
        }
        break;
    }
    case TIM_DMA_CC1:
    {
        /* Set the DMA compare callbacks */
        htim->hdma[TIM_DMA_ID_CC1]->XferCpltCallback = TIM_DMADelayPulseCplt;
        htim->hdma[TIM_DMA_ID_CC1]->XferHalfCpltCallback = TIM_DMADelayPulseHalfCplt;

        /* Set the DMA error callback */
        htim->hdma[TIM_DMA_ID_CC1]->XferErrorCallback = TIM_DMAError ;

        /* Enable the DMA channel */
        if (HAL_DMA_Start_IT(htim->hdma[TIM_DMA_ID_CC1], (uint32_t)BurstBuffer,
                             (uint32_t)&htim->Instance->DMAR, DataLength) != HAL_OK)
        {
            return HAL_ERROR;
        }
        break;
    }
    case TIM_DMA_CC2:
    {
        /* Set the DMA compare callbacks */
        htim->hdma[TIM_DMA_ID_CC2]->XferCpltCallback = TIM_DMADelayPulseCplt;
        htim->hdma[TIM_DMA_ID_CC2]->XferHalfCpltCallback = TIM_DMADelayPulseHalfCplt;

        /* Set the DMA error callback */
        htim->hdma[TIM_DMA_ID_CC2]->XferErrorCallback = TIM_DMAError ;

        /* Enable the DMA channel */
        if (HAL_DMA_Start_IT(htim->hdma[TIM_DMA_ID_CC2], (uint32_t)BurstBuffer,
                             (uint32_t)&htim->Instance->DMAR, DataLength) != HAL_OK)
        {
            return HAL_ERROR;
        }
        break;
    }
    case TIM_DMA_CC3:
    {
        /* Set the DMA compare callbacks */
        htim->hdma[TIM_DMA_ID_CC3]->XferCpltCallback = TIM_DMADelayPulseCplt;
        htim->hdma[TIM_DMA_ID_CC3]->XferHalfCpltCallback = TIM_DMADelayPulseHalfCplt;

        /* Set the DMA error callback */
        htim->hdma[TIM_DMA_ID_CC3]->XferErrorCallback = TIM_DMAError ;

        /* Enable the DMA channel */
        if (HAL_DMA_Start_IT(htim->hdma[TIM_DMA_ID_CC3], (uint32_t)BurstBuffer,
                             (uint32_t)&htim->Instance->DMAR, DataLength) != HAL_OK)
        {
            return HAL_ERROR;
        }
        break;
    }
    case TIM_DMA_CC4:
    {
        /* Set the DMA compare callbacks */
        htim->hdma[TIM_DMA_ID_CC4]->XferCpltCallback = TIM_DMADelayPulseCplt;
        htim->hdma[TIM_DMA_ID_CC4]->XferHalfCpltCallback = TIM_DMADelayPulseHalfCplt;

        /* Set the DMA error callback */
        htim->hdma[TIM_DMA_ID_CC4]->XferErrorCallback = TIM_DMAError ;

        /* Enable the DMA channel */
        if (HAL_DMA_Start_IT(htim->hdma[TIM_DMA_ID_CC4], (uint32_t)BurstBuffer,
                             (uint32_t)&htim->Instance->DMAR, DataLength) != HAL_OK)
        {
            return HAL_ERROR;
        }
        break;
    }
    case TIM_DMA_COM:
    {
        /* Set the DMA commutation callbacks */
        htim->hdma[TIM_DMA_ID_COMMUTATION]->XferCpltCallback =  TIMEx_DMACommutationCplt;
        htim->hdma[TIM_DMA_ID_COMMUTATION]->XferHalfCpltCallback =  TIMEx_DMACommutationHalfCplt;

        /* Set the DMA error callback */
        htim->hdma[TIM_DMA_ID_COMMUTATION]->XferErrorCallback = TIM_DMAError ;

        /* Enable the DMA channel */
        if (HAL_DMA_Start_IT(htim->hdma[TIM_DMA_ID_COMMUTATION], (uint32_t)BurstBuffer,
                             (uint32_t)&htim->Instance->DMAR, DataLength) != HAL_OK)
        {
            return HAL_ERROR;
        }
        break;
    }
    case TIM_DMA_TRIGGER:
    {
        /* Set the DMA trigger callbacks */
        htim->hdma[TIM_DMA_ID_TRIGGER]->XferCpltCallback = TIM_DMATriggerCplt;
        htim->hdma[TIM_DMA_ID_TRIGGER]->XferHalfCpltCallback = TIM_DMATriggerHalfCplt;

        /* Set the DMA error callback */
        htim->hdma[TIM_DMA_ID_TRIGGER]->XferErrorCallback = TIM_DMAError ;

        /* Enable the DMA channel */
        if (HAL_DMA_Start_IT(htim->hdma[TIM_DMA_ID_TRIGGER], (uint32_t)BurstBuffer,
                             (uint32_t)&htim->Instance->DMAR, DataLength) != HAL_OK)
        {
            return HAL_ERROR;
        }
        break;
    }
    default:
        break;
    }

    /* Configure the DMA Burst Mode */
    htim->Instance->DCR = (BurstBaseAddress | BurstLength);
    /* Enable the TIM DMA Request */
    __HAL_TIM_ENABLE_DMA(htim, BurstRequestSrc);

    htim->State = HAL_TIM_STATE_READY;

    /* Return function status */
    return HAL_OK;
}

/**
  * @brief  Stops the TIM DMA Burst mode
  * @param  htim TIM handle
  * @param  BurstRequestSrc TIM DMA Request sources to disable
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_TIM_DMABurst_WriteStop(TIM_HandleTypeDef *htim, uint32_t BurstRequestSrc)
{
    HAL_StatusTypeDef status = HAL_OK;
    /* Check the parameters */
    assert_param(IS_TIM_DMA_SOURCE(BurstRequestSrc));

    /* Abort the DMA transfer (at least disable the DMA channel) */
    switch (BurstRequestSrc)
    {
    case TIM_DMA_UPDATE:
    {
        status = HAL_DMA_Abort_IT(htim->hdma[TIM_DMA_ID_UPDATE]);
        break;
    }
    case TIM_DMA_CC1:
    {
        status = HAL_DMA_Abort_IT(htim->hdma[TIM_DMA_ID_CC1]);
        break;
    }
    case TIM_DMA_CC2:
    {
        status = HAL_DMA_Abort_IT(htim->hdma[TIM_DMA_ID_CC2]);
        break;
    }
    case TIM_DMA_CC3:
    {
        status =  HAL_DMA_Abort_IT(htim->hdma[TIM_DMA_ID_CC3]);
        break;
    }
    case TIM_DMA_CC4:
    {
        status = HAL_DMA_Abort_IT(htim->hdma[TIM_DMA_ID_CC4]);
        break;
    }
    case TIM_DMA_COM:
    {
        status = HAL_DMA_Abort_IT(htim->hdma[TIM_DMA_ID_COMMUTATION]);
        break;
    }
    case TIM_DMA_TRIGGER:
    {
        status = HAL_DMA_Abort_IT(htim->hdma[TIM_DMA_ID_TRIGGER]);
        break;
    }
    default:
        break;
    }

