sh-lyf/XenD101_HPS/Driver/py32f003/PY32F003_HAL_Driver/Src/py32f003_hal_tim.c
    if (HAL_OK == status)
    {
        /* Disable the TIM Update DMA request */
        __HAL_TIM_DISABLE_DMA(htim, BurstRequestSrc);
    }

    /* Return function status */
    return status;
}

/**
  * @brief  Generate a software event
  * @param  htim TIM handle
  * @param  EventSource specifies the event source.
  *          This parameter can be one of the following values:
  *            @arg TIM_EVENTSOURCE_UPDATE: Timer update Event source
  *            @arg TIM_EVENTSOURCE_CC1: Timer Capture Compare 1 Event source
  *            @arg TIM_EVENTSOURCE_CC2: Timer Capture Compare 2 Event source
  *            @arg TIM_EVENTSOURCE_CC3: Timer Capture Compare 3 Event source
  *            @arg TIM_EVENTSOURCE_CC4: Timer Capture Compare 4 Event source
  *            @arg TIM_EVENTSOURCE_COM: Timer COM event source
  *            @arg TIM_EVENTSOURCE_TRIGGER: Timer Trigger Event source
  *            @arg TIM_EVENTSOURCE_BREAK: Timer Break event source
  * @note   Basic timers can only generate an update event.
  * @note   TIM_EVENTSOURCE_COM is relevant only with advanced timer instances.
  * @note   TIM_EVENTSOURCE_BREAK are relevant only for timer instances
  *         supporting a break input.
  * @retval HAL status
  */

HAL_StatusTypeDef HAL_TIM_GenerateEvent(TIM_HandleTypeDef *htim, uint32_t EventSource)
{
    /* Check the parameters */
    assert_param(IS_TIM_INSTANCE(htim->Instance));
    assert_param(IS_TIM_EVENT_SOURCE(EventSource));

    /* Process Locked */
    __HAL_LOCK(htim);

    /* Change the TIM state */
    htim->State = HAL_TIM_STATE_BUSY;

    /* Set the event sources */
    htim->Instance->EGR = EventSource;

    /* Change the TIM state */
    htim->State = HAL_TIM_STATE_READY;

    __HAL_UNLOCK(htim);

    /* Return function status */
    return HAL_OK;
}

/**
  * @brief  Configures the OCRef clear feature
  * @param  htim TIM handle
  * @param  sClearInputConfig pointer to a TIM_ClearInputConfigTypeDef structure that
  *         contains the OCREF clear feature and parameters for the TIM peripheral.
  * @param  Channel specifies the TIM Channel
  *          This parameter can be one of the following values:
  *            @arg TIM_CHANNEL_1: TIM Channel 1
  *            @arg TIM_CHANNEL_2: TIM Channel 2
  *            @arg TIM_CHANNEL_3: TIM Channel 3
  *            @arg TIM_CHANNEL_4: TIM Channel 4
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_TIM_ConfigOCrefClear(TIM_HandleTypeDef *htim,
        TIM_ClearInputConfigTypeDef *sClearInputConfig,
        uint32_t Channel)
{
    /* Check the parameters */
    assert_param(IS_TIM_OCXREF_CLEAR_INSTANCE(htim->Instance));
    assert_param(IS_TIM_CLEARINPUT_SOURCE(sClearInputConfig->ClearInputSource));

    /* Process Locked */
    __HAL_LOCK(htim);

    htim->State = HAL_TIM_STATE_BUSY;

    switch (sClearInputConfig->ClearInputSource)
    {
    case TIM_CLEARINPUTSOURCE_NONE:
    {
        /* Clear the OCREF clear selection bit and the the ETR Bits */
        CLEAR_BIT(htim->Instance->SMCR, (TIM_SMCR_OCCS | TIM_SMCR_ETF | TIM_SMCR_ETPS | TIM_SMCR_ECE | TIM_SMCR_ETP));
        break;
    }
    case TIM_CLEARINPUTSOURCE_OCREFCLR:
    {
        /* Clear the OCREF clear selection bit */
        CLEAR_BIT(htim->Instance->SMCR, TIM_SMCR_OCCS);
    }
    break;

    case TIM_CLEARINPUTSOURCE_ETR:
    {
        /* Check the parameters */
        assert_param(IS_TIM_CLEARINPUT_POLARITY(sClearInputConfig->ClearInputPolarity));
        assert_param(IS_TIM_CLEARINPUT_PRESCALER(sClearInputConfig->ClearInputPrescaler));
        assert_param(IS_TIM_CLEARINPUT_FILTER(sClearInputConfig->ClearInputFilter));

        /* When OCRef clear feature is used with ETR source, ETR prescaler must be off */
        if (sClearInputConfig->ClearInputPrescaler != TIM_CLEARINPUTPRESCALER_DIV1)
        {
            htim->State = HAL_TIM_STATE_READY;
            __HAL_UNLOCK(htim);
            return HAL_ERROR;
        }

        TIM_ETR_SetConfig(htim->Instance,
                          sClearInputConfig->ClearInputPrescaler,
                          sClearInputConfig->ClearInputPolarity,
                          sClearInputConfig->ClearInputFilter);

        /* Set the OCREF clear selection bit */
        SET_BIT(htim->Instance->SMCR, TIM_SMCR_OCCS);
        break;
    }

    default:
        break;
    }

    switch (Channel)
    {
    case TIM_CHANNEL_1:
    {
        if (sClearInputConfig->ClearInputState != (uint32_t)DISABLE)
        {
            /* Enable the OCREF clear feature for Channel 1 */
            SET_BIT(htim->Instance->CCMR1, TIM_CCMR1_OC1CE);
        }
        else
        {
            /* Disable the OCREF clear feature for Channel 1 */
            CLEAR_BIT(htim->Instance->CCMR1, TIM_CCMR1_OC1CE);
        }
        break;
    }
    case TIM_CHANNEL_2:
    {
        if (sClearInputConfig->ClearInputState != (uint32_t)DISABLE)
        {
            /* Enable the OCREF clear feature for Channel 2 */
            SET_BIT(htim->Instance->CCMR1, TIM_CCMR1_OC2CE);
        }
        else
        {
            /* Disable the OCREF clear feature for Channel 2 */
            CLEAR_BIT(htim->Instance->CCMR1, TIM_CCMR1_OC2CE);
        }
        break;
    }
    case TIM_CHANNEL_3:
    {
        if (sClearInputConfig->ClearInputState != (uint32_t)DISABLE)
        {
            /* Enable the OCREF clear feature for Channel 3 */
            SET_BIT(htim->Instance->CCMR2, TIM_CCMR2_OC3CE);
        }
        else
        {
            /* Disable the OCREF clear feature for Channel 3 */
            CLEAR_BIT(htim->Instance->CCMR2, TIM_CCMR2_OC3CE);
        }
        break;
    }
    case TIM_CHANNEL_4:
    {
        if (sClearInputConfig->ClearInputState != (uint32_t)DISABLE)
        {
            /* Enable the OCREF clear feature for Channel 4 */
            SET_BIT(htim->Instance->CCMR2, TIM_CCMR2_OC4CE);
        }
        else
        {
            /* Disable the OCREF clear feature for Channel 4 */
            CLEAR_BIT(htim->Instance->CCMR2, TIM_CCMR2_OC4CE);
        }
        break;
    }
    default:
        break;
    }

    htim->State = HAL_TIM_STATE_READY;

    __HAL_UNLOCK(htim);

    return HAL_OK;
}

/**
  * @brief   Configures the clock source to be used
  * @param  htim TIM handle
  * @param  sClockSourceConfig pointer to a TIM_ClockConfigTypeDef structure that
  *         contains the clock source information for the TIM peripheral.
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_TIM_ConfigClockSource(TIM_HandleTypeDef *htim, TIM_ClockConfigTypeDef *sClockSourceConfig)
{
    uint32_t tmpsmcr;

    /* Process Locked */
    __HAL_LOCK(htim);

    htim->State = HAL_TIM_STATE_BUSY;

    /* Check the parameters */
    assert_param(IS_TIM_CLOCKSOURCE(sClockSourceConfig->ClockSource));

    /* Reset the SMS, TS, ECE, ETPS and ETRF bits */
    tmpsmcr = htim->Instance->SMCR;
    tmpsmcr &= ~(TIM_SMCR_SMS | TIM_SMCR_TS);
    tmpsmcr &= ~(TIM_SMCR_ETF | TIM_SMCR_ETPS | TIM_SMCR_ECE | TIM_SMCR_ETP);
    htim->Instance->SMCR = tmpsmcr;

