sh-lyf/XenD101_HPS/Driver/py32f003/PY32F003_HAL_Driver/Src/py32f003_hal_tim.c
    switch (sClockSourceConfig->ClockSource)
    {
    case TIM_CLOCKSOURCE_INTERNAL:
    {
        assert_param(IS_TIM_INSTANCE(htim->Instance));
        break;
    }

    case TIM_CLOCKSOURCE_ETRMODE1:
    {
        /* Check whether or not the timer instance supports external trigger input mode 1 (ETRF)*/
        assert_param(IS_TIM_CLOCKSOURCE_ETRMODE1_INSTANCE(htim->Instance));

        /* Check ETR input conditioning related parameters */
        assert_param(IS_TIM_CLOCKPRESCALER(sClockSourceConfig->ClockPrescaler));
        assert_param(IS_TIM_CLOCKPOLARITY(sClockSourceConfig->ClockPolarity));
        assert_param(IS_TIM_CLOCKFILTER(sClockSourceConfig->ClockFilter));

        /* Configure the ETR Clock source */
        TIM_ETR_SetConfig(htim->Instance,
                          sClockSourceConfig->ClockPrescaler,
                          sClockSourceConfig->ClockPolarity,
                          sClockSourceConfig->ClockFilter);

        /* Select the External clock mode1 and the ETRF trigger */
        tmpsmcr = htim->Instance->SMCR;
        tmpsmcr |= (TIM_SLAVEMODE_EXTERNAL1 | TIM_CLOCKSOURCE_ETRMODE1);
        /* Write to TIMx SMCR */
        htim->Instance->SMCR = tmpsmcr;
        break;
    }

    case TIM_CLOCKSOURCE_ETRMODE2:
    {
        /* Check whether or not the timer instance supports external trigger input mode 2 (ETRF)*/
        assert_param(IS_TIM_CLOCKSOURCE_ETRMODE2_INSTANCE(htim->Instance));

        /* Check ETR input conditioning related parameters */
        assert_param(IS_TIM_CLOCKPRESCALER(sClockSourceConfig->ClockPrescaler));
        assert_param(IS_TIM_CLOCKPOLARITY(sClockSourceConfig->ClockPolarity));
        assert_param(IS_TIM_CLOCKFILTER(sClockSourceConfig->ClockFilter));

        /* Configure the ETR Clock source */
        TIM_ETR_SetConfig(htim->Instance,
                          sClockSourceConfig->ClockPrescaler,
                          sClockSourceConfig->ClockPolarity,
                          sClockSourceConfig->ClockFilter);
        /* Enable the External clock mode2 */
        htim->Instance->SMCR |= TIM_SMCR_ECE;
        break;
    }

    case TIM_CLOCKSOURCE_TI1:
    {
        /* Check whether or not the timer instance supports external clock mode 1 */
        assert_param(IS_TIM_CLOCKSOURCE_TIX_INSTANCE(htim->Instance));

        /* Check TI1 input conditioning related parameters */
        assert_param(IS_TIM_CLOCKPOLARITY(sClockSourceConfig->ClockPolarity));
        assert_param(IS_TIM_CLOCKFILTER(sClockSourceConfig->ClockFilter));

        TIM_TI1_ConfigInputStage(htim->Instance,
                                 sClockSourceConfig->ClockPolarity,
                                 sClockSourceConfig->ClockFilter);
        TIM_ITRx_SetConfig(htim->Instance, TIM_CLOCKSOURCE_TI1);
        break;
    }

    case TIM_CLOCKSOURCE_TI2:
    {
        /* Check whether or not the timer instance supports external clock mode 1 (ETRF)*/
        assert_param(IS_TIM_CLOCKSOURCE_TIX_INSTANCE(htim->Instance));

        /* Check TI2 input conditioning related parameters */
        assert_param(IS_TIM_CLOCKPOLARITY(sClockSourceConfig->ClockPolarity));
        assert_param(IS_TIM_CLOCKFILTER(sClockSourceConfig->ClockFilter));

        TIM_TI2_ConfigInputStage(htim->Instance,
                                 sClockSourceConfig->ClockPolarity,
                                 sClockSourceConfig->ClockFilter);
        TIM_ITRx_SetConfig(htim->Instance, TIM_CLOCKSOURCE_TI2);
        break;
    }

    case TIM_CLOCKSOURCE_TI1ED:
    {
        /* Check whether or not the timer instance supports external clock mode 1 */
        assert_param(IS_TIM_CLOCKSOURCE_TIX_INSTANCE(htim->Instance));

        /* Check TI1 input conditioning related parameters */
        assert_param(IS_TIM_CLOCKPOLARITY(sClockSourceConfig->ClockPolarity));
        assert_param(IS_TIM_CLOCKFILTER(sClockSourceConfig->ClockFilter));

        TIM_TI1_ConfigInputStage(htim->Instance,
                                 sClockSourceConfig->ClockPolarity,
                                 sClockSourceConfig->ClockFilter);
        TIM_ITRx_SetConfig(htim->Instance, TIM_CLOCKSOURCE_TI1ED);
        break;
    }

    case TIM_CLOCKSOURCE_ITR0:
    case TIM_CLOCKSOURCE_ITR1:
    case TIM_CLOCKSOURCE_ITR2:
    case TIM_CLOCKSOURCE_ITR3:
    {
        /* Check whether or not the timer instance supports internal trigger input */
        assert_param(IS_TIM_CLOCKSOURCE_ITRX_INSTANCE(htim->Instance));

        TIM_ITRx_SetConfig(htim->Instance, sClockSourceConfig->ClockSource);
        break;
    }

    default:
        break;
    }
    htim->State = HAL_TIM_STATE_READY;

    __HAL_UNLOCK(htim);

    return HAL_OK;
}

/**
  * @brief  Selects the signal connected to the TI1 input: direct from CH1_input
  *         or a XOR combination between CH1_input, CH2_input & CH3_input
  * @param  htim TIM handle.
  * @param  TI1_Selection Indicate whether or not channel 1 is connected to the
  *         output of a XOR gate.
  *          This parameter can be one of the following values:
  *            @arg TIM_TI1SELECTION_CH1: The TIMx_CH1 pin is connected to TI1 input
  *            @arg TIM_TI1SELECTION_XORCOMBINATION: The TIMx_CH1, CH2 and CH3
  *            pins are connected to the TI1 input (XOR combination)
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_TIM_ConfigTI1Input(TIM_HandleTypeDef *htim, uint32_t TI1_Selection)
{
    uint32_t tmpcr2;

    /* Check the parameters */
    assert_param(IS_TIM_XOR_INSTANCE(htim->Instance));
    assert_param(IS_TIM_TI1SELECTION(TI1_Selection));

    /* Get the TIMx CR2 register value */
    tmpcr2 = htim->Instance->CR2;

    /* Reset the TI1 selection */
    tmpcr2 &= ~TIM_CR2_TI1S;

    /* Set the TI1 selection */
    tmpcr2 |= TI1_Selection;

    /* Write to TIMxCR2 */
    htim->Instance->CR2 = tmpcr2;

    return HAL_OK;
}

/**
  * @brief  Configures the TIM in Slave mode
  * @param  htim TIM handle.
  * @param  sSlaveConfig pointer to a TIM_SlaveConfigTypeDef structure that
  *         contains the selected trigger (internal trigger input, filtered
  *         timer input or external trigger input) and the Slave mode
  *         (Disable, Reset, Gated, Trigger, External clock mode 1).
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_TIM_SlaveConfigSynchro(TIM_HandleTypeDef *htim, TIM_SlaveConfigTypeDef *sSlaveConfig)
{
    /* Check the parameters */
    assert_param(IS_TIM_SLAVE_INSTANCE(htim->Instance));
    assert_param(IS_TIM_SLAVE_MODE(sSlaveConfig->SlaveMode));
    assert_param(IS_TIM_TRIGGER_SELECTION(sSlaveConfig->InputTrigger));

    __HAL_LOCK(htim);

    htim->State = HAL_TIM_STATE_BUSY;

    if (TIM_SlaveTimer_SetConfig(htim, sSlaveConfig) != HAL_OK)
    {
        htim->State = HAL_TIM_STATE_READY;
        __HAL_UNLOCK(htim);
        return HAL_ERROR;
    }

