sh-lyf/XenD101_HPS/Driver/py32f003/PY32F003_HAL_Driver/Src/py32f003_hal_tim.c
        case HAL_TIM_BASE_MSPDEINIT_CB_ID :
            htim->Base_MspDeInitCallback               = pCallback;
            break;

        case HAL_TIM_IC_MSPINIT_CB_ID :
            htim->IC_MspInitCallback                   = pCallback;
            break;

        case HAL_TIM_IC_MSPDEINIT_CB_ID :
            htim->IC_MspDeInitCallback                 = pCallback;
            break;

        case HAL_TIM_OC_MSPINIT_CB_ID :
            htim->OC_MspInitCallback                   = pCallback;
            break;

        case HAL_TIM_OC_MSPDEINIT_CB_ID :
            htim->OC_MspDeInitCallback                 = pCallback;
            break;

        case HAL_TIM_PWM_MSPINIT_CB_ID :
            htim->PWM_MspInitCallback                  = pCallback;
            break;

        case HAL_TIM_PWM_MSPDEINIT_CB_ID :
            htim->PWM_MspDeInitCallback                = pCallback;
            break;

        case HAL_TIM_ONE_PULSE_MSPINIT_CB_ID :
            htim->OnePulse_MspInitCallback             = pCallback;
            break;

        case HAL_TIM_ONE_PULSE_MSPDEINIT_CB_ID :
            htim->OnePulse_MspDeInitCallback           = pCallback;
            break;

        case HAL_TIM_ENCODER_MSPINIT_CB_ID :
            htim->Encoder_MspInitCallback              = pCallback;
            break;

        case HAL_TIM_ENCODER_MSPDEINIT_CB_ID :
            htim->Encoder_MspDeInitCallback            = pCallback;
            break;

        case HAL_TIM_HALL_SENSOR_MSPINIT_CB_ID :
            htim->HallSensor_MspInitCallback           = pCallback;
            break;

        case HAL_TIM_HALL_SENSOR_MSPDEINIT_CB_ID :
            htim->HallSensor_MspDeInitCallback         = pCallback;
            break;

        case HAL_TIM_PERIOD_ELAPSED_CB_ID :
            htim->PeriodElapsedCallback                = pCallback;
            break;

        case HAL_TIM_PERIOD_ELAPSED_HALF_CB_ID :
            htim->PeriodElapsedHalfCpltCallback        = pCallback;
            break;

        case HAL_TIM_TRIGGER_CB_ID :
            htim->TriggerCallback                      = pCallback;
            break;

        case HAL_TIM_TRIGGER_HALF_CB_ID :
            htim->TriggerHalfCpltCallback              = pCallback;
            break;

        case HAL_TIM_IC_CAPTURE_CB_ID :
            htim->IC_CaptureCallback                   = pCallback;
            break;

        case HAL_TIM_IC_CAPTURE_HALF_CB_ID :
            htim->IC_CaptureHalfCpltCallback           = pCallback;
            break;

        case HAL_TIM_OC_DELAY_ELAPSED_CB_ID :
            htim->OC_DelayElapsedCallback              = pCallback;
            break;

        case HAL_TIM_PWM_PULSE_FINISHED_CB_ID :
            htim->PWM_PulseFinishedCallback            = pCallback;
            break;

        case HAL_TIM_PWM_PULSE_FINISHED_HALF_CB_ID :
            htim->PWM_PulseFinishedHalfCpltCallback    = pCallback;
            break;

        case HAL_TIM_ERROR_CB_ID :
            htim->ErrorCallback                        = pCallback;
            break;

        case HAL_TIM_COMMUTATION_CB_ID :
            htim->CommutationCallback                  = pCallback;
            break;

        case HAL_TIM_COMMUTATION_HALF_CB_ID :
            htim->CommutationHalfCpltCallback          = pCallback;
            break;

        case HAL_TIM_BREAK_CB_ID :
            htim->BreakCallback                        = pCallback;
            break;

        default :
            /* Return error status */
            status =  HAL_ERROR;
            break;
        }
    }
    else if (htim->State == HAL_TIM_STATE_RESET)
    {
        switch (CallbackID)
        {
        case HAL_TIM_BASE_MSPINIT_CB_ID :
            htim->Base_MspInitCallback         = pCallback;
            break;

        case HAL_TIM_BASE_MSPDEINIT_CB_ID :
            htim->Base_MspDeInitCallback       = pCallback;
            break;

        case HAL_TIM_IC_MSPINIT_CB_ID :
            htim->IC_MspInitCallback           = pCallback;
            break;

        case HAL_TIM_IC_MSPDEINIT_CB_ID :
            htim->IC_MspDeInitCallback         = pCallback;
            break;

        case HAL_TIM_OC_MSPINIT_CB_ID :
            htim->OC_MspInitCallback           = pCallback;
            break;

        case HAL_TIM_OC_MSPDEINIT_CB_ID :
            htim->OC_MspDeInitCallback         = pCallback;
            break;

        case HAL_TIM_PWM_MSPINIT_CB_ID :
            htim->PWM_MspInitCallback          = pCallback;
            break;

        case HAL_TIM_PWM_MSPDEINIT_CB_ID :
            htim->PWM_MspDeInitCallback        = pCallback;
            break;

        case HAL_TIM_ONE_PULSE_MSPINIT_CB_ID :
            htim->OnePulse_MspInitCallback     = pCallback;
            break;

        case HAL_TIM_ONE_PULSE_MSPDEINIT_CB_ID :
            htim->OnePulse_MspDeInitCallback   = pCallback;
            break;

        case HAL_TIM_ENCODER_MSPINIT_CB_ID :
            htim->Encoder_MspInitCallback      = pCallback;
            break;

        case HAL_TIM_ENCODER_MSPDEINIT_CB_ID :
            htim->Encoder_MspDeInitCallback    = pCallback;
            break;

        case HAL_TIM_HALL_SENSOR_MSPINIT_CB_ID :
            htim->HallSensor_MspInitCallback   = pCallback;
            break;

        case HAL_TIM_HALL_SENSOR_MSPDEINIT_CB_ID :
            htim->HallSensor_MspDeInitCallback = pCallback;
            break;

        default :
            /* Return error status */
            status =  HAL_ERROR;
            break;
        }
    }
    else
    {
        /* Return error status */
        status =  HAL_ERROR;
    }

    /* Release Lock */
    __HAL_UNLOCK(htim);

    return status;
}

/**
  * @brief  Unregister a TIM callback
  *         TIM callback is redirected to the weak predefined callback
  * @param htim tim handle
  * @param CallbackID ID of the callback to be unregistered
  *        This parameter can be one of the following values:
  *          @arg @ref HAL_TIM_BASE_MSPINIT_CB_ID Base MspInit Callback ID
  *          @arg @ref HAL_TIM_BASE_MSPDEINIT_CB_ID Base MspDeInit Callback ID
  *          @arg @ref HAL_TIM_IC_MSPINIT_CB_ID IC MspInit Callback ID
  *          @arg @ref HAL_TIM_IC_MSPDEINIT_CB_ID IC MspDeInit Callback ID
  *          @arg @ref HAL_TIM_OC_MSPINIT_CB_ID OC MspInit Callback ID
  *          @arg @ref HAL_TIM_OC_MSPDEINIT_CB_ID OC MspDeInit Callback ID
  *          @arg @ref HAL_TIM_PWM_MSPINIT_CB_ID PWM MspInit Callback ID
  *          @arg @ref HAL_TIM_PWM_MSPDEINIT_CB_ID PWM MspDeInit Callback ID
  *          @arg @ref HAL_TIM_ONE_PULSE_MSPINIT_CB_ID One Pulse MspInit Callback ID
  *          @arg @ref HAL_TIM_ONE_PULSE_MSPDEINIT_CB_ID One Pulse MspDeInit Callback ID
  *          @arg @ref HAL_TIM_ENCODER_MSPINIT_CB_ID Encoder MspInit Callback ID
  *          @arg @ref HAL_TIM_ENCODER_MSPDEINIT_CB_ID Encoder MspDeInit Callback ID
  *          @arg @ref HAL_TIM_HALL_SENSOR_MSPINIT_CB_ID Hall Sensor MspInit Callback ID
  *          @arg @ref HAL_TIM_HALL_SENSOR_MSPDEINIT_CB_ID Hall Sensor MspDeInit Callback ID
  *          @arg @ref HAL_TIM_PERIOD_ELAPSED_CB_ID Period Elapsed Callback ID
  *          @arg @ref HAL_TIM_PERIOD_ELAPSED_HALF_CB_ID Period Elapsed half complete Callback ID
  *          @arg @ref HAL_TIM_TRIGGER_CB_ID Trigger Callback ID
  *          @arg @ref HAL_TIM_TRIGGER_HALF_CB_ID Trigger half complete Callback ID
  *          @arg @ref HAL_TIM_IC_CAPTURE_CB_ID Input Capture Callback ID
  *          @arg @ref HAL_TIM_IC_CAPTURE_HALF_CB_ID Input Capture half complete Callback ID
  *          @arg @ref HAL_TIM_OC_DELAY_ELAPSED_CB_ID Output Compare Delay Elapsed Callback ID
  *          @arg @ref HAL_TIM_PWM_PULSE_FINISHED_CB_ID PWM Pulse Finished Callback ID
  *          @arg @ref HAL_TIM_PWM_PULSE_FINISHED_HALF_CB_ID PWM Pulse Finished half complete Callback ID
  *          @arg @ref HAL_TIM_ERROR_CB_ID Error Callback ID
  *          @arg @ref HAL_TIM_COMMUTATION_CB_ID Commutation Callback ID
  *          @arg @ref HAL_TIM_COMMUTATION_HALF_CB_ID Commutation half complete Callback ID
  *          @arg @ref HAL_TIM_BREAK_CB_ID Break Callback ID
  *          @retval status
  */
HAL_StatusTypeDef HAL_TIM_UnRegisterCallback(TIM_HandleTypeDef *htim, HAL_TIM_CallbackIDTypeDef CallbackID)
{
    HAL_StatusTypeDef status = HAL_OK;

    /* Process locked */
    __HAL_LOCK(htim);

    if (htim->State == HAL_TIM_STATE_READY)
    {
        switch (CallbackID)
        {
        case HAL_TIM_BASE_MSPINIT_CB_ID :
            htim->Base_MspInitCallback              = HAL_TIM_Base_MspInit;                      /* Legacy weak Base MspInit Callback */
            break;

