sh-lyf/XenD101_HPS/Driver/py32f003/PY32F003_HAL_Driver/Src/py32f003_hal_tim.c
    if (IS_TIM_CCXN_INSTANCE(TIMx, TIM_CHANNEL_3))
    {
        assert_param(IS_TIM_OCN_POLARITY(OC_Config->OCNPolarity));

        /* Reset the Output N Polarity level */
        tmpccer &= ~TIM_CCER_CC3NP;
        /* Set the Output N Polarity */
        tmpccer |= (OC_Config->OCNPolarity << 8U);
        /* Reset the Output N State */
        tmpccer &= ~TIM_CCER_CC3NE;
    }

    if (IS_TIM_BREAK_INSTANCE(TIMx))
    {
        /* Check parameters */
        assert_param(IS_TIM_OCNIDLE_STATE(OC_Config->OCNIdleState));
        assert_param(IS_TIM_OCIDLE_STATE(OC_Config->OCIdleState));

        /* Reset the Output Compare and Output Compare N IDLE State */
        tmpcr2 &= ~TIM_CR2_OIS3;
        tmpcr2 &= ~TIM_CR2_OIS3N;
        /* Set the Output Idle state */
        tmpcr2 |= (OC_Config->OCIdleState << 4U);
        /* Set the Output N Idle state */
        tmpcr2 |= (OC_Config->OCNIdleState << 4U);
    }

    /* Write to TIMx CR2 */
    TIMx->CR2 = tmpcr2;

    /* Write to TIMx CCMR2 */
    TIMx->CCMR2 = tmpccmrx;

    /* Set the Capture Compare Register value */
    TIMx->CCR3 = OC_Config->Pulse;

    /* Write to TIMx CCER */
    TIMx->CCER = tmpccer;
}

/**
  * @brief  Timer Output Compare 4 configuration
  * @param  TIMx to select the TIM peripheral
  * @param  OC_Config The ouput configuration structure
  * @retval None
  */
static void TIM_OC4_SetConfig(TIM_TypeDef *TIMx, TIM_OC_InitTypeDef *OC_Config)
{
    uint32_t tmpccmrx;
    uint32_t tmpccer;
    uint32_t tmpcr2;

    /* Disable the Channel 4: Reset the CC4E Bit */
    TIMx->CCER &= ~TIM_CCER_CC4E;

    /* Get the TIMx CCER register value */
    tmpccer = TIMx->CCER;
    /* Get the TIMx CR2 register value */
    tmpcr2 =  TIMx->CR2;

    /* Get the TIMx CCMR2 register value */
    tmpccmrx = TIMx->CCMR2;

    /* Reset the Output Compare mode and Capture/Compare selection Bits */
    tmpccmrx &= ~TIM_CCMR2_OC4M;
    tmpccmrx &= ~TIM_CCMR2_CC4S;

    /* Select the Output Compare Mode */
    tmpccmrx |= (OC_Config->OCMode << 8U);

    /* Reset the Output Polarity level */
    tmpccer &= ~TIM_CCER_CC4P;
    /* Set the Output Compare Polarity */
    tmpccer |= (OC_Config->OCPolarity << 12U);

    if (IS_TIM_BREAK_INSTANCE(TIMx))
    {
        /* Check parameters */
        assert_param(IS_TIM_OCIDLE_STATE(OC_Config->OCIdleState));

        /* Reset the Output Compare IDLE State */
        tmpcr2 &= ~TIM_CR2_OIS4;

        /* Set the Output Idle state */
        tmpcr2 |= (OC_Config->OCIdleState << 6U);
    }

    /* Write to TIMx CR2 */
    TIMx->CR2 = tmpcr2;

    /* Write to TIMx CCMR2 */
    TIMx->CCMR2 = tmpccmrx;

    /* Set the Capture Compare Register value */
    TIMx->CCR4 = OC_Config->Pulse;

    /* Write to TIMx CCER */
    TIMx->CCER = tmpccer;
}

/**
  * @brief  Slave Timer configuration function
  * @param  htim TIM handle
  * @param  sSlaveConfig Slave timer configuration
  * @retval None
  */
static HAL_StatusTypeDef TIM_SlaveTimer_SetConfig(TIM_HandleTypeDef *htim,
        TIM_SlaveConfigTypeDef *sSlaveConfig)
{
    uint32_t tmpsmcr;
    uint32_t tmpccmr1;
    uint32_t tmpccer;

    /* Get the TIMx SMCR register value */
    tmpsmcr = htim->Instance->SMCR;

    /* Reset the Trigger Selection Bits */
    tmpsmcr &= ~TIM_SMCR_TS;
    /* Set the Input Trigger source */
    tmpsmcr |= sSlaveConfig->InputTrigger;

    /* Reset the slave mode Bits */
    tmpsmcr &= ~TIM_SMCR_SMS;
    /* Set the slave mode */
    tmpsmcr |= sSlaveConfig->SlaveMode;

    /* Write to TIMx SMCR */
    htim->Instance->SMCR = tmpsmcr;

    /* Configure the trigger prescaler, filter, and polarity */
    switch (sSlaveConfig->InputTrigger)
    {
    case TIM_TS_ETRF:
    {
        /* Check the parameters */
        assert_param(IS_TIM_CLOCKSOURCE_ETRMODE1_INSTANCE(htim->Instance));
        assert_param(IS_TIM_TRIGGERPRESCALER(sSlaveConfig->TriggerPrescaler));
        assert_param(IS_TIM_TRIGGERPOLARITY(sSlaveConfig->TriggerPolarity));
        assert_param(IS_TIM_TRIGGERFILTER(sSlaveConfig->TriggerFilter));
        /* Configure the ETR Trigger source */
        TIM_ETR_SetConfig(htim->Instance,
                          sSlaveConfig->TriggerPrescaler,
                          sSlaveConfig->TriggerPolarity,
                          sSlaveConfig->TriggerFilter);
        break;
    }

    case TIM_TS_TI1F_ED:
    {
        /* Check the parameters */
        assert_param(IS_TIM_CC1_INSTANCE(htim->Instance));
        assert_param(IS_TIM_TRIGGERFILTER(sSlaveConfig->TriggerFilter));

        if(sSlaveConfig->SlaveMode == TIM_SLAVEMODE_GATED)
        {
            return HAL_ERROR;
        }

        /* Disable the Channel 1: Reset the CC1E Bit */
        tmpccer = htim->Instance->CCER;
        htim->Instance->CCER &= ~TIM_CCER_CC1E;
        tmpccmr1 = htim->Instance->CCMR1;

        /* Set the filter */
        tmpccmr1 &= ~TIM_CCMR1_IC1F;
        tmpccmr1 |= ((sSlaveConfig->TriggerFilter) << 4U);

        /* Write to TIMx CCMR1 and CCER registers */
        htim->Instance->CCMR1 = tmpccmr1;
        htim->Instance->CCER = tmpccer;
        break;
    }

    case TIM_TS_TI1FP1:
    {
        /* Check the parameters */
        assert_param(IS_TIM_CC1_INSTANCE(htim->Instance));
        assert_param(IS_TIM_TRIGGERPOLARITY(sSlaveConfig->TriggerPolarity));
        assert_param(IS_TIM_TRIGGERFILTER(sSlaveConfig->TriggerFilter));

        /* Configure TI1 Filter and Polarity */
        TIM_TI1_ConfigInputStage(htim->Instance,
                                 sSlaveConfig->TriggerPolarity,
                                 sSlaveConfig->TriggerFilter);
        break;
    }

    case TIM_TS_TI2FP2:
    {
        /* Check the parameters */
        assert_param(IS_TIM_CC2_INSTANCE(htim->Instance));
        assert_param(IS_TIM_TRIGGERPOLARITY(sSlaveConfig->TriggerPolarity));
        assert_param(IS_TIM_TRIGGERFILTER(sSlaveConfig->TriggerFilter));

        /* Configure TI2 Filter and Polarity */
        TIM_TI2_ConfigInputStage(htim->Instance,
                                 sSlaveConfig->TriggerPolarity,
                                 sSlaveConfig->TriggerFilter);
        break;
    }

    case TIM_TS_ITR0:
    case TIM_TS_ITR1:
    case TIM_TS_ITR2:
    case TIM_TS_ITR3:
    {
        /* Check the parameter */
        assert_param(IS_TIM_CC2_INSTANCE(htim->Instance));
        break;
    }

    default:
        break;
    }
    return HAL_OK;
}

/**
  * @brief  Configure the TI1 as Input.
  * @param  TIMx to select the TIM peripheral.
  * @param  TIM_ICPolarity The Input Polarity.
  *          This parameter can be one of the following values:
  *            @arg TIM_ICPOLARITY_RISING
  *            @arg TIM_ICPOLARITY_FALLING
  *            @arg TIM_ICPOLARITY_BOTHEDGE
  * @param  TIM_ICSelection specifies the input to be used.
  *          This parameter can be one of the following values:
  *            @arg TIM_ICSELECTION_DIRECTTI: TIM Input 1 is selected to be connected to IC1.
  *            @arg TIM_ICSELECTION_INDIRECTTI: TIM Input 1 is selected to be connected to IC2.
  *            @arg TIM_ICSELECTION_TRC: TIM Input 1 is selected to be connected to TRC.
  * @param  TIM_ICFilter Specifies the Input Capture Filter.
  *          This parameter must be a value between 0x00 and 0x0F.
  * @retval None
  * @note TIM_ICFilter and TIM_ICPolarity are not used in INDIRECT mode as TI2FP1
  *       (on channel2 path) is used as the input signal. Therefore CCMR1 must be
  *        protected against un-initialized filter and polarity values.
  */
void TIM_TI1_SetConfig(TIM_TypeDef *TIMx, uint32_t TIM_ICPolarity, uint32_t TIM_ICSelection,
                       uint32_t TIM_ICFilter)
{
    uint32_t tmpccmr1;
    uint32_t tmpccer;

